1.
Ներածություն,ծանոթություն,(php hypertext preprocessor)
web սերվերի տեղակայում,xampp
փոփոխականներ,կոմենտարիաներ,
տպող ֆունկցիաներ:
փոփոխականների տիպերը,կախվածությունը ռեգիստորից,
դինամիկ փոփոխականներ,հաստատուններ
տիպերը որոշող և փոխող ֆունկցիաներ
isset,unset,empty ֆունկցիաներ:
php կոդավորման կանոնները
2.Օպերատորներ
թվաբանական,վերագրման,համեմատական,տրամաբանական,
ինկրեմենտային,դեկրեմենտային,բիտային,սխալի:
օպերատորների առաջնահերթությունները
if,else,elseif,for,while,do while,switch,break,continue,
տերնար օպերատոր ?: ??
3 Ինդեքսային և ասոցիատիվ զանգվածներ,զանգվածի երկարությունը
foreach
4.ֆունկցիաներ:
ֆունկցիաների հայտարարումը,ֆունկցիաների կանչը:
ըստ արժեքի և ըստ հղման պարամետրեր:տիպավորված պարամետրեր:
վերադարձ ֆունկցիայից (return);
վերադարձվող արժեքի տիպը:
local,global,static փոփոխականներ,$_GLOBALS:
5.ռեկուրսիվ ֆունկցիաներ,մաթեմատիկական ֆունկցիաներ:
 declare truetype=1
6. php զանգվածների հետ աշխատող ֆունկցիաներ:
7.ֆորմաներ, post,get մեթոդներ,$_POST,$_GET,$_REQUEST զանգվածներ
header() ֆունկցիան,$_SESSION զանգվածը:
8.php տողերի հետ աշխատող ֆունկցիաներ:
9.ajax,json
10.php ժամանակի հետ աշխատող ֆունկցիաներ,$_COOKIE:
11.php ֆայլերի և դիրեկտորիաների հետ աշխատող ֆունկցիաներ:
12.ֆայլերի ներբեռնում,$_FILES, multiple uploading,
 ֆայլերի միացում include,require, include_once,require_once
13.ՌԵգիստրացիայի էջի ստեղծում:
14.ռեգուլյար արտահայտություններ:
15.նորությունների էջի ստեղծում:
16.php կարգավորումներ,.htacces,php.ini,CURL
17.MYSQL տվյալների բազա,բազայի նախագծում,հիմնական և արտաքին բանալիներ,
պրիվիլեգիաներ:
18.MYSQL դաշտերի տիպերը
not null,primary key,foreign key,unique,index,default
create,alter,drop
19.insert,update,delete,select
20.order by,distinct,between,in,alias,binary
21.like,regexp,ագրեգացիայի ֆունկցիաներ:
22.group by,having
23.inner join,outer join ,left join,right join,cross join,union
24.mysqli ֆունկցիաներ:
25-29 օնլայն խանութի կայքի ստեղծում:
30.OOP կլասներ և օբյեկտներ:Կլասի հայտարարումը,հատկություններ և մեթոդներ
 public,protected,private, կոնստրուկտորներ և դեստրուկտորներ,$this 
31.աբստրակտ կլասներ և ֆունկցիաներ,Ժառանգում,static ֆունկցիաներ և փոփոխականներ
ինտերֆեյսներ:

32.Կոմպոզիցիա,__autoload,__toString
33.__set,__get,__isset,__unset,__invoke,
34.__call,__callStatic,__sleep,__wakeup,__clone
35.մոգական փոփոխականներ
__namespace,__dir__,__file__,__line__,__class__,__method__
36.final կլասներ և ֆունկցիաներ,trait ներ, exception
37-39 codeigniter:
